clc, clear, close all

U1 = [10,20,10,20,20,10,20,10,10,10];
e1 = [15,10,16, 8, 9,15, 7,15,15,16];
m1 = [25,20,24,22,21,25,23,25,25,24];

hold on 
scatter(0:100:900,U1,"filled","r")
scatter(0:100:900,e1,"filled","b")
scatter(0:100:900,m1,"filled","g")
plot(0:100:900,U1,"r")
plot(0:100:900,e1,"b")
plot(0:100:900,m1,"g")
legend("","","","URLLC切片","eMBB切片","mMTC切片","east")

title("第三问基站1（SB1）动态优化结果图")
xlabel("调度时间（单位是毫秒）")
ylabel("资源块数量")

% 
% U2 = [20,10,10,10,20,10,10,10,20,10];
% e2 = [5,15,16, 18, 9,15,17,15, 5,16];
% m2 = [25,25,24,22,21,25,23,25,25,24];
% 
% hold on 
% scatter(0:100:900,U2,"filled","r")
% scatter(0:100:900,e2,"filled","b")
% scatter(0:100:900,m2,"filled","g")
% plot(0:100:900,U2,"r")
% plot(0:100:900,e2,"b")
% plot(0:100:900,m2,"g")
% legend("","","","URLLC切片","eMBB切片","mMTC切片","east")
% 
% title("第三问基站2（SB2）动态优化结果图")
% xlabel("调度时间（单位是毫秒）")
% ylabel("资源块数量")

% U2 = [10,12,10,10,20,10,10,10,20,10];
% e2 = [15,20,16,17, 9,15,16,16,10,16];
% m2 = [25,18,24,23,21,25,24,24,20,24];
% 
% hold on 
% scatter(0:100:900,U2,"filled","r")
% scatter(0:100:900,e2,"filled","b")
% scatter(0:100:900,m2,"filled","g")
% plot(0:100:900,U2,"r")
% plot(0:100:900,e2,"b")
% plot(0:100:900,m2,"g")
% legend("","","","URLLC切片","eMBB切片","mMTC切片","east")
% 
% title("第三问基站3（SB3）动态优化结果图")
% xlabel("调度时间（单位是毫秒）")
% ylabel("资源块数量")



% U2 = [10,11,10,10,10,10,11,10,10,10];
% e2 = [11,10,10,11,10,11,11,10,11,10];
% m2 = [25,28,29,23,29,25,24,24,25,24];
% 
% hold on 
% scatter(0:100:900,U2,"r")
% scatter(0:100:900,e2,"b")
% scatter(0:100:900,m2,"g")
% plot(0:100:900,U2,"r")
% plot(0:100:900,e2,"b")
% plot(0:100:900,m2,"g")
% legend("","","","基站1功率","基站2功率","基站3功率","east")
% 
% title("第三问三个微基站发射功率的动态优化结果图")
% xlabel("调度时间（单位是毫秒）")
% ylabel("发射功率（单位是dBm）")

