clc, clear, close all

U1 = [10,20,10,20,20,11,20,10,13,13];
e1 = [15, 8,16, 8, 9,15, 7,20,15,16];
m1 = [25,22,24,22,21,24,23,20,22,21];

hold on 
scatter(0:100:900,U1,"filled","r")
scatter(0:100:900,e1,"filled","b")
scatter(0:100:900,m1,"filled","g")
plot(0:100:900,U1,"r")
plot(0:100:900,e1,"b")
plot(0:100:900,m1,"g")
legend("","","","URLLC切片","eMBB切片","mMTC切片","east")

title("第四问微基站1（SBS1）动态优化结果图")
xlabel("调度时间（单位是毫秒）")
ylabel("资源块数量")


% U2 = [20,10,10,10,20,11,10,13,20,10];
% e2 = [ 5,15,16,15, 9,15,17,16, 9,20];
% m2 = [25,25,24,25,21,24,23,21,21,20];
% 
% hold on 
% scatter(0:100:900,U2,"filled","r")
% scatter(0:100:900,e2,"filled","b")
% scatter(0:100:900,m2,"filled","g")
% plot(0:100:900,U2,"r")
% plot(0:100:900,e2,"b")
% plot(0:100:900,m2,"g")
% legend("","","","URLLC切片","eMBB切片","mMTC切片","east")
% 
% title("第四问微基站2（SBS2）动态优化结果图")
% xlabel("调度时间（单位是毫秒）")
% ylabel("资源块数量")

% U2 = [10,12,20,10,20,11,10,10,20,10];
% e2 = [15,20, 6,17, 9,15,16,18,10,18];
% m2 = [25,18,24,23,21,24,24,22,20,22];
% 
% hold on 
% scatter(0:100:900,U2,"filled","r")
% scatter(0:100:900,e2,"filled","b")
% scatter(0:100:900,m2,"filled","g")
% plot(0:100:900,U2,"r")
% plot(0:100:900,e2,"b")
% plot(0:100:900,m2,"g")
% legend("","","","URLLC切片","eMBB切片","mMTC切片","east")
% 
% title("第四问微基站3（SBS3）动态优化结果图")
% xlabel("调度时间（单位是毫秒）")
% ylabel("资源块数量")


% U2 = [10,12,10,10,20,10,10,10,20,10];
% e2 = [15,20,16,17, 9,15,16,16,10,16];
% m2 = [25,18,24,23,21,25,24,24,20,24];
% 
% hold on 
% scatter(0:100:900,U2,"filled","r")
% scatter(0:100:900,e2,"filled","b")
% scatter(0:100:900,m2,"filled","g")
% plot(0:100:900,U2,"r")
% plot(0:100:900,e2,"b")
% plot(0:100:900,m2,"g")
% legend("","","","URLLC切片","eMBB切片","mMTC切片","east")
% 
% title("第四问宏基站（MBS_1）动态优化结果图")
% xlabel("调度时间（单位是毫秒）")
% ylabel("资源块数量")


% U2 = [10,11,10,10,10,10,11,10,10,10];
% e2 = [11,10,10,11,10,11,11,10,11,10];
% m2 = [25,28,29,23,29,25,24,24,25,24];
% m22 = [36,35,39,38,36,37,37,34,38,39];
% 
% hold on 
% scatter(0:100:900,U2,"r")
% scatter(0:100:900,e2,"b")
% scatter(0:100:900,m2,"g")
% scatter(0:100:900,m22,"k")
% plot(0:100:900,U2,"r")
% plot(0:100:900,e2,"b")
% plot(0:100:900,m2,"g")
% plot(0:100:900,m22,"k")
% legend("","","","","微基站1功率","微基站2功率","微基站3功率","宏基站1功率","east")
% 
% title("第四问3个微基站和1个宏基站发射功率的动态优化结果图")
% xlabel("调度时间（单位是毫秒）")
% ylabel("发射功率（单位是dBm）")

